bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64M1.xml
<?xml version="1.0" encoding="UTF-8"?>
<target-description-file>
    <variants>
        <variant ordercode="ATmega64M1-AU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="TQFPQFN32"
                 package="TQFP32" vccmin="2.7" vccmax="5.5"/>
        <variant ordercode="ATmega64M1-MU" tempmin="-40" tempmax="85" speedmax="16000000" pinout="TQFPQFN32"
                 package="QFN32" vccmin="2.7" vccmax="5.5"/>
    </variants>
    <device name="ATmega64M1" family="AVR8" architecture="AVR8" avr-family="megaAVR">
        <address-spaces>
            <address-space endianness="little" name="prog" id="prog" start="0x0000" size="0x10000">
                <memory-segment start="0x0000" size="0x10000" type="flash" rw="RW" exec="1" name="FLASH"
                                pagesize="0x100"/>
                <memory-segment start="0xfc00" size="0x0400" type="flash" rw="RW" exec="1" name="BOOT_SECTION_1"
                                pagesize="0x100"/>
                <memory-segment start="0xf800" size="0x0800" type="flash" rw="RW" exec="1" name="BOOT_SECTION_2"
                                pagesize="0x100"/>
                <memory-segment start="0xf000" size="0x1000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_3"
                                pagesize="0x100"/>
                <memory-segment start="0xe000" size="0x2000" type="flash" rw="RW" exec="1" name="BOOT_SECTION_4"
                                pagesize="0x100"/>
            </address-space>
            <address-space endianness="little" name="signatures" id="signatures" start="0" size="3">
                <memory-segment start="0" size="3" type="signatures" rw="R" exec="0" name="SIGNATURES"/>
            </address-space>
            <address-space endianness="little" name="fuses" id="fuses" start="0" size="0x0003">
                <memory-segment start="0" size="0x0003" type="fuses" rw="RW" exec="0" name="FUSES"/>
            </address-space>
            <address-space endianness="little" name="lockbits" id="lockbits" start="0" size="0x0001">
                <memory-segment start="0" size="0x0001" type="lockbits" rw="RW" exec="0" name="LOCKBITS"/>
            </address-space>
            <address-space endianness="little" name="data" id="data" start="0x0000" size="0x1100">
                <memory-segment external="false" type="regs" size="0x0020" start="0x0000" name="REGISTERS"/>
                <memory-segment name="MAPPED_IO" start="0x0020" size="0x00e0" type="io" external="false"/>
                <memory-segment name="IRAM" start="0x0100" size="0x1000" type="ram" external="false"/>
            </address-space>
            <address-space endianness="little" name="eeprom" id="eeprom" start="0x0000" size="0x0800">
                <memory-segment start="0x0000" size="0x0800" type="eeprom" rw="RW" exec="0" name="EEPROM"
                                pagesize="0x08"/>
            </address-space>
            <address-space size="0x40" start="0x00" endianness="little" name="io" id="io"/>
            <address-space endianness="little" name="osccal" id="osccal" start="0" size="1">
                <memory-segment start="0" size="1" type="osccal" rw="R" exec="0" name="OSCCAL"/>
            </address-space>
        </address-spaces>
        <peripherals>
            <module name="PORT">
                <instance name="PORTB" caption="I/O Port">
                    <register-group name="PORTB" name-in-module="PORTB" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal function="IOPORT" group="PIN" index="0" pad="PB0"/>
                        <signal function="IOPORT" group="PIN" index="1" pad="PB1"/>
                        <signal function="IOPORT" group="PIN" index="2" pad="PB2"/>
                        <signal function="IOPORT" group="PIN" index="3" pad="PB3"/>
                        <signal function="IOPORT" group="PIN" index="4" pad="PB4"/>
                        <signal function="IOPORT" group="PIN" index="5" pad="PB5"/>
                        <signal function="IOPORT" group="PIN" index="6" pad="PB6"/>
                        <signal function="IOPORT" group="PIN" index="7" pad="PB7"/>
                    </signals>
                </instance>
                <instance name="PORTC" caption="I/O Port">
                    <register-group name="PORTC" name-in-module="PORTC" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal function="IOPORT" group="PIN" index="0" pad="PC0"/>
                        <signal function="IOPORT" group="PIN" index="1" pad="PC1"/>
                        <signal function="IOPORT" group="PIN" index="2" pad="PC2"/>
                        <signal function="IOPORT" group="PIN" index="3" pad="PC3"/>
                        <signal function="IOPORT" group="PIN" index="4" pad="PC4"/>
                        <signal function="IOPORT" group="PIN" index="5" pad="PC5"/>
                        <signal function="IOPORT" group="PIN" index="6" pad="PC6"/>
                        <signal function="IOPORT" group="PIN" index="7" pad="PC7"/>
                    </signals>
                </instance>
                <instance name="PORTD" caption="I/O Port">
                    <register-group name="PORTD" name-in-module="PORTD" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal function="IOPORT" group="PIN" index="0" pad="PD0"/>
                        <signal function="IOPORT" group="PIN" index="1" pad="PD1"/>
                        <signal function="IOPORT" group="PIN" index="2" pad="PD2"/>
                        <signal function="IOPORT" group="PIN" index="3" pad="PD3"/>
                        <signal function="IOPORT" group="PIN" index="4" pad="PD4"/>
                        <signal function="IOPORT" group="PIN" index="5" pad="PD5"/>
                        <signal function="IOPORT" group="PIN" index="6" pad="PD6"/>
                        <signal function="IOPORT" group="PIN" index="7" pad="PD7"/>
                    </signals>
                </instance>
                <instance name="PORTE" caption="I/O Port">
                    <register-group name="PORTE" name-in-module="PORTE" offset="0x00" address-space="data"
                                    caption="I/O Port"/>
                    <signals>
                        <signal function="IOPORT" group="PIN" index="0" pad="PE0"/>
                        <signal function="IOPORT" group="PIN" index="1" pad="PE1"/>
                        <signal function="IOPORT" group="PIN" index="2" pad="PE2"/>
                    </signals>
                </instance>
            </module>
            <module name="CAN">
                <instance name="CAN" caption="Controller Area Network">
                    <register-group name="CAN" name-in-module="CAN" offset="0x00" address-space="data"
                                    caption="Controller Area Network"/>
                </instance>
            </module>
            <module name="AC">
                <instance name="AC" caption="Analog Comparator">
                    <register-group name="AC" name-in-module="AC" offset="0x00" address-space="data"
                                    caption="Analog Comparator"/>
                    <signals>
                        <signal function="AC" group="ACMP" index="0" pad="PD7"/>
                        <signal function="AC" group="ACMP" index="1" pad="PC6"/>
                        <signal function="AC" group="ACMP" index="2" pad="PD5"/>
                        <signal function="AC" group="ACMP" index="3" pad="PC5"/>
                        <signal function="AC" group="ACMPN" index="0" pad="PB2"/>
                        <signal function="AC" group="ACMPN" index="1" pad="PB5"/>
                        <signal function="AC" group="ACMPN" index="2" pad="PD6"/>
                        <signal function="AC" group="ACMPN" index="3" pad="PC4"/>
                    </signals>
                </instance>
            </module>
