bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64M1.xml
            <module name="DAC">
                <instance name="DAC" caption="Digital-to-Analog Converter">
                    <register-group name="DAC" name-in-module="DAC" offset="0x00" address-space="data"
                                    caption="Digital-to-Analog Converter"/>
                    <signals>
                        <signal function="DAC" group="D2A" pad="PC7"/>
                    </signals>
                </instance>
            </module>
            <module name="CPU">
                <instance name="CPU" caption="CPU Registers">
                    <register-group name="CPU" name-in-module="CPU" offset="0x00" address-space="data"
                                    caption="CPU Registers"/>
                    <parameters>
                        <param name="CORE_VERSION" value="V2E"/>
                    </parameters>
                </instance>
            </module>
            <module name="TC8">
                <instance name="TC0" caption="Timer/Counter, 8-bit">
                    <register-group name="TC0" name-in-module="TC0" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 8-bit"/>
                    <signals>
                        <signal function="TC0" group="T0" pad="PC2"/>
                        <signal function="TC0" group="OC0A" pad="PD3"/>
                        <signal function="TC0" group="OC0B" pad="PE1"/>
                    </signals>
                </instance>
            </module>
            <module name="TC16">
                <instance name="TC1" caption="Timer/Counter, 16-bit">
                    <register-group name="TC1" name-in-module="TC1" offset="0x00" address-space="data"
                                    caption="Timer/Counter, 16-bit"/>
                    <signals>
                        <signal function="TC1" group="T1" pad="PC3"/>
                        <signal function="TC1" group="ICP1A" pad="PD4"/>
                        <signal function="TC1" group="ICP1B" pad="PC3"/>
                        <signal function="TC1" group="OC1A" pad="PD2"/>
                        <signal function="TC1" group="OC1B" pad="PC1"/>
                    </signals>
                </instance>
            </module>
            <module name="ADC">
                <instance name="ADC" caption="Analog-to-Digital Converter">
                    <register-group name="ADC" name-in-module="ADC" offset="0x00" address-space="data"
                                    caption="Analog-to-Digital Converter"/>
                    <signals>
                        <signal function="ADC" group="ADC" index="0" pad="PE2"/>
                        <signal function="ADC" group="ADC" index="1" pad="PD4"/>
                        <signal function="ADC" group="ADC" index="2" pad="PD5"/>
                        <signal function="ADC" group="ADC" index="3" pad="PD6"/>
                        <signal function="ADC" group="ADC" index="4" pad="PB7"/>
                        <signal function="ADC" group="ADC" index="5" pad="PB2"/>
                        <signal function="ADC" group="ADC" index="6" pad="PB5"/>
                        <signal function="ADC" group="ADC" index="7" pad="PB6"/>
                        <signal function="ADC" group="ADC" index="8" pad="PC4"/>
                        <signal function="ADC" group="ADC" index="9" pad="PC5"/>
                        <signal function="ADC" group="ADC" index="10" pad="PC6"/>
                    </signals>
                </instance>
            </module>
            <module name="LINUART">
                <instance name="LINUART" caption="Local Interconnect Network">
                    <register-group name="LINUART" name-in-module="LINUART" offset="0x00" address-space="data"
                                    caption="Local Interconnect Network"/>
                    <signals>
                        <signal function="LIN" group="TXLIN" pad="PD3"/>
                        <signal function="LIN" group="RXLIN" pad="PD4"/>
                    </signals>
                </instance>
            </module>
            <module name="SPI">
                <instance name="SPI" caption="Serial Peripheral Interface">
                    <register-group name="SPI" name-in-module="SPI" offset="0x00" address-space="data"
                                    caption="Serial Peripheral Interface"/>
                    <signals>
                        <signal function="SPI" group="MISO" pad="PB0"/>
                        <signal function="SPI_ALT" group="MISO" pad="PD2"/>
                        <signal function="SPI" group="MOSI" pad="PB1"/>
                        <signal function="SPI_ALT" group="MOSI" pad="PD3"/>
                        <signal function="SPI" group="SCK" pad="PB7"/>
                        <signal function="SPI_ALT" group="SCK" pad="PD4"/>
                        <signal function="SPI" group="SS" pad="PD3"/>
                        <signal function="SPI_ALT" group="SS" pad="PC1"/>
                    </signals>
                </instance>
            </module>
            <module name="WDT">
                <instance name="WDT" caption="Watchdog Timer">
                    <register-group name="WDT" name-in-module="WDT" offset="0x00" address-space="data"
                                    caption="Watchdog Timer"/>
                </instance>
            </module>
            <module name="EXINT">
                <instance name="EXINT" caption="External Interrupts">
                    <register-group name="EXINT" name-in-module="EXINT" offset="0x00" address-space="data"
                                    caption="External Interrupts"/>
                    <signals>
                        <signal function="EXINT" group="INT" index="0" pad="PD6"/>
                        <signal function="EXINT" group="INT" index="1" pad="PB2"/>
                        <signal function="EXINT" group="INT" index="2" pad="PB5"/>
                        <signal function="EXINT" group="INT" index="3" pad="PC0"/>
                        <signal function="EXINT" group="PCINT" index="0" pad="PB0"/>
                        <signal function="EXINT" group="PCINT" index="1" pad="PB1"/>
                        <signal function="EXINT" group="PCINT" index="2" pad="PB2"/>
                        <signal function="EXINT" group="PCINT" index="3" pad="PB3"/>
                        <signal function="EXINT" group="PCINT" index="4" pad="PB4"/>
                        <signal function="EXINT" group="PCINT" index="5" pad="PB5"/>
                        <signal function="EXINT" group="PCINT" index="6" pad="PB6"/>
                        <signal function="EXINT" group="PCINT" index="7" pad="PB7"/>
                        <signal function="EXINT" group="PCINT" index="8" pad="PC0"/>
                        <signal function="EXINT" group="PCINT" index="9" pad="PC1"/>
                        <signal function="EXINT" group="PCINT" index="10" pad="PC2"/>
                        <signal function="EXINT" group="PCINT" index="11" pad="PC3"/>
                        <signal function="EXINT" group="PCINT" index="12" pad="PC4"/>
                        <signal function="EXINT" group="PCINT" index="13" pad="PC5"/>
                        <signal function="EXINT" group="PCINT" index="14" pad="PC6"/>
                        <signal function="EXINT" group="PCINT" index="15" pad="PC7"/>
                        <signal function="EXINT" group="PCINT" index="16" pad="PD0"/>
                        <signal function="EXINT" group="PCINT" index="17" pad="PD1"/>
                        <signal function="EXINT" group="PCINT" index="18" pad="PD2"/>
                        <signal function="EXINT" group="PCINT" index="19" pad="PD3"/>
                        <signal function="EXINT" group="PCINT" index="20" pad="PD4"/>
                        <signal function="EXINT" group="PCINT" index="21" pad="PD5"/>
                        <signal function="EXINT" group="PCINT" index="22" pad="PD6"/>
                        <signal function="EXINT" group="PCINT" index="23" pad="PD7"/>
                        <signal function="EXINT" group="PCINT" index="24" pad="PE0"/>
                        <signal function="EXINT" group="PCINT" index="25" pad="PE1"/>
                        <signal function="EXINT" group="PCINT" index="26" pad="PE2"/>
                    </signals>
                </instance>
            </module>
            <module name="EEPROM">
                <instance name="EEPROM" caption="EEPROM">
                    <register-group name="EEPROM" name-in-module="EEPROM" offset="0x00" address-space="data"
                                    caption="EEPROM"/>
                </instance>
            </module>
            <module name="PSC">
                <instance name="PSC" caption="Power Stage Controller">
                    <register-group name="PSC" name-in-module="PSC" offset="0x00" address-space="data"
                                    caption="Power Stage Controller"/>
                    <signals>
                        <signal function="PSC" group="PSCIN2" pad="PD2"/>
                        <signal function="PSC" group="PSCOUT2A" pad="PB0"/>
                        <signal function="PSC" group="PSCOUT2B" pad="PB1"/>
                        <signal function="PSC" group="PSCIN1" pad="PC1"/>
                        <signal function="PSC" group="PSCOUT1A" pad="PC0"/>
                        <signal function="PSC" group="PSCOUT1B" pad="PB6"/>
                        <signal function="PSC" group="PSCIN0" pad="PD1"/>
                        <signal function="PSC" group="PSCOUT0A" pad="PD0"/>
                        <signal function="PSC" group="PSCOUT0B" pad="PB7"/>
                    </signals>
                </instance>
            </module>
            <module name="FUSE">
                <instance name="FUSE" caption="Fuses">
                    <register-group name="FUSE" name-in-module="FUSE" offset="0" address-space="fuses"
                                    caption="Fuses"/>
                </instance>
            </module>
