bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64M1.xml
            <module name="LOCKBIT">
                <instance name="LOCKBIT" caption="Lockbits">
                    <register-group name="LOCKBIT" name-in-module="LOCKBIT" offset="0" address-space="lockbits"
                                    caption="Lockbits"/>
                </instance>
            </module>
        </peripherals>
        <interrupts>
            <interrupt index="0" name="RESET"
                       caption="External Pin, Power-on Reset, Brown-out Reset, Watchdog Reset and JTAG AVR Reset"/>
            <interrupt index="1" name="ANACOMP0" caption="Analog Comparator 0"/>
            <interrupt index="2" name="ANACOMP1" caption="Analog Comparator 1"/>
            <interrupt index="3" name="ANACOMP2" caption="Analog Comparator 2"/>
            <interrupt index="4" name="ANACOMP3" caption="Analog Comparator 3"/>
            <interrupt index="5" name="PSC_FAULT" caption="PSC Fault"/>
            <interrupt index="6" name="PSC_EC" caption="PSC End of Cycle"/>
            <interrupt index="7" name="INT0" caption="External Interrupt Request 0"/>
            <interrupt index="8" name="INT1" caption="External Interrupt Request 1"/>
            <interrupt index="9" name="INT2" caption="External Interrupt Request 2"/>
            <interrupt index="10" name="INT3" caption="External Interrupt Request 3"/>
            <interrupt index="11" name="TIMER1_CAPT" caption="Timer/Counter1 Capture Event"/>
            <interrupt index="12" name="TIMER1_COMPA" caption="Timer/Counter1 Compare Match A"/>
            <interrupt index="13" name="TIMER1_COMPB" caption="Timer/Counter1 Compare Match B"/>
            <interrupt index="14" name="TIMER1_OVF" caption="Timer1/Counter1 Overflow"/>
            <interrupt index="15" name="TIMER0_COMPA" caption="Timer/Counter0 Compare Match A"/>
            <interrupt index="16" name="TIMER0_COMPB" caption="Timer/Counter0 Compare Match B"/>
            <interrupt index="17" name="TIMER0_OVF" caption="Timer/Counter0 Overflow"/>
            <interrupt index="18" name="CAN_INT" caption="CAN MOB, Burst, General Errors"/>
            <interrupt index="19" name="CAN_TOVF" caption="CAN Timer Overflow"/>
            <interrupt index="20" name="LIN_TC" caption="LIN Transfer Complete"/>
            <interrupt index="21" name="LIN_ERR" caption="LIN Error"/>
            <interrupt index="22" name="PCINT0" caption="Pin Change Interrupt Request 0"/>
            <interrupt index="23" name="PCINT1" caption="Pin Change Interrupt Request 1"/>
            <interrupt index="24" name="PCINT2" caption="Pin Change Interrupt Request 2"/>
            <interrupt index="25" name="PCINT3" caption="Pin Change Interrupt Request 3"/>
            <interrupt index="26" name="SPI_STC" caption="SPI Serial Transfer Complete"/>
            <interrupt index="27" name="ADC" caption="ADC Conversion Complete"/>
            <interrupt index="28" name="WDT" caption="Watchdog Time-Out Interrupt"/>
            <interrupt index="29" name="EE_READY" caption="EEPROM Ready"/>
            <interrupt index="30" name="SPM_READY" caption="Store Program Memory Read"/>
        </interrupts>
        <interfaces>
            <interface name="ISP" type="isp"/>
            <interface name="HVPP" type="hvpp"/>
            <interface name="debugWIRE" type="dw"/>
        </interfaces>
        <property-groups>
            <property-group name="SIGNATURES">
                <property name="JTAGID" value="0x9684"/>
                <property name="SIGNATURE0" value="0x1e"/>
                <property name="SIGNATURE1" value="0x96"/>
                <property name="SIGNATURE2" value="0x84"/>
            </property-group>
            <property-group name="OCD">
                <property name="OCD_REVISION" value="1"/>
                <property name="OCD_DATAREG" value="0x31"/>
                <property name="PROGBASE" value="0x0000"/>
            </property-group>
            <property-group name="JTAG_INTERFACE">
                <property name="ALLOWFULLPAGESTREAM" value="0x00"/>
            </property-group>
            <property-group name="ISP_INTERFACE">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="45"/>
                <property name="IspChipErase_pollMethod" value="1"/>
                <property name="IspProgramFlash_mode" value="0x41"/>
                <property name="IspProgramFlash_blockSize" value="256"/>
                <property name="IspProgramFlash_delay" value="10"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x00"/>
                <property name="IspProgramFlash_pollVal1" value="0x00"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x41"/>
                <property name="IspProgramEeprom_blockSize" value="8"/>
                <property name="IspProgramEeprom_delay" value="10"/>
                <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                <property name="IspProgramEeprom_cmd3" value="0x00"/>
                <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="15"/>
                <property name="PpEnterProgMode_resetDelayMs" value="1"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0F"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
            <property-group name="ISP_INTERFACE_STK600">
                <property name="IspEnterProgMode_timeout" value="200"/>
                <property name="IspEnterProgMode_stabDelay" value="100"/>
                <property name="IspEnterProgMode_cmdexeDelay" value="25"/>
                <property name="IspEnterProgMode_synchLoops" value="32"/>
                <property name="IspEnterProgMode_byteDelay" value="0"/>
                <property name="IspEnterProgMode_pollIndex" value="3"/>
                <property name="IspEnterProgMode_pollValue" value="0x53"/>
                <property name="IspLeaveProgMode_preDelay" value="1"/>
                <property name="IspLeaveProgMode_postDelay" value="1"/>
                <property name="IspChipErase_eraseDelay" value="45"/>
                <property name="IspChipErase_pollMethod" value="1"/>
                <property name="IspProgramFlash_mode" value="0x41"/>
                <property name="IspProgramFlash_blockSize" value="256"/>
                <property name="IspProgramFlash_delay" value="6"/>
                <property name="IspProgramFlash_cmd1" value="0x40"/>
                <property name="IspProgramFlash_cmd2" value="0x4C"/>
                <property name="IspProgramFlash_cmd3" value="0x00"/>
                <property name="IspProgramFlash_pollVal1" value="0x00"/>
                <property name="IspProgramFlash_pollVal2" value="0x00"/>
                <property name="IspProgramEeprom_mode" value="0x41"/>
                <property name="IspProgramEeprom_blockSize" value="4"/>
                <property name="IspProgramEeprom_delay" value="5"/>
                <property name="IspProgramEeprom_cmd1" value="0xC1"/>
                <property name="IspProgramEeprom_cmd2" value="0xC2"/>
                <property name="IspProgramEeprom_cmd3" value="0x00"/>
                <property name="IspProgramEeprom_pollVal1" value="0x00"/>
                <property name="IspProgramEeprom_pollVal2" value="0x00"/>
                <property name="IspReadFlash_blockSize" value="256"/>
                <property name="IspReadEeprom_blockSize" value="256"/>
                <property name="IspReadFuse_pollIndex" value="4"/>
                <property name="IspReadLock_pollIndex" value="4"/>
                <property name="IspReadSign_pollIndex" value="4"/>
                <property name="IspReadOsccal_pollIndex" value="4"/>
            </property-group>
            <property-group name="PP_INTERFACE_STK600">
                <property name="PpControlStack"
                          value="0x0E 0x1E 0x0F 0x1F 0x2E 0x3E 0x2F 0x3F 0x4E 0x5E 0x4F 0x5F 0x6E 0x7E 0x6F 0x7F 0x66 0x76 0x67 0x77 0x6A 0x7A 0x6B 0x7B 0xBE 0xFD 0x00 0x01 0x00 0x00 0x00 0x00"/>
                <property name="PpEnterProgMode_stabDelay" value="100"/>
                <property name="PpEnterProgMode_progModeDelay" value="0"/>
                <property name="PpEnterProgMode_latchCycles" value="5"/>
                <property name="PpEnterProgMode_toggleVtg" value="1"/>
                <property name="PpEnterProgMode_powerOffDelay" value="15"/>
                <property name="PpEnterProgMode_resetDelayMs" value="1"/>
                <property name="PpEnterProgMode_resetDelayUs" value="0"/>
                <property name="PpLeaveProgMode_stabDelay" value="15"/>
                <property name="PpLeaveProgMode_resetDelay" value="15"/>
                <property name="PpChipErase_pulseWidth" value="0"/>
                <property name="PpChipErase_pollTimeout" value="10"/>
                <property name="PpProgramFlash_pollTimeout" value="5"/>
                <property name="PpProgramFlash_mode" value="0x0F"/>
                <property name="PpProgramFlash_blockSize" value="256"/>
                <property name="PpReadFlash_blockSize" value="256"/>
                <property name="PpProgramEeprom_pollTimeout" value="5"/>
                <property name="PpProgramEeprom_mode" value="0x05"/>
                <property name="PpProgramEeprom_blockSize" value="256"/>
                <property name="PpReadEeprom_blockSize" value="256"/>
                <property name="PpProgramFuse_pulseWidth" value="0"/>
                <property name="PpProgramFuse_pollTimeout" value="5"/>
                <property name="PpProgramLock_pulseWidth" value="0"/>
                <property name="PpProgramLock_pollTimeout" value="5"/>
            </property-group>
        </property-groups>
    </device>
    <modules>
        <module caption="Fuses" name="FUSE">
            <register-group caption="Fuses" name="FUSE">
                <register caption="" name="EXTENDED" offset="0x02" size="1" initval="0xFF">
                    <bitfield caption="PSC Reset Behavior" mask="0x20" name="PSCRB"/>
                    <bitfield caption="PSCOUTnA Reset Value" mask="0x10" name="PSCRVA"/>
                    <bitfield caption="PSC0UTnB Reset Value" mask="0x08" name="PSCRVB"/>
                    <bitfield caption="Brown-out Detector Trigger Level" mask="0x07" name="BODLEVEL"
                              values="ENUM_BODLEVEL"/>
                </register>
