bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64M1.xml
                <register caption="Identifier Mask Register 2" name="CANIDM2" offset="0xF6" size="1" mask="0xFF">
                    <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="13"/>
                </register>
                <register caption="Identifier Mask Register 1" name="CANIDM1" offset="0xF7" size="1" mask="0xFF">
                    <bitfield caption="Identifier Mask" mask="0xFF" name="IDMSK" lsb="21"/>
                </register>
                <register caption="Time Stamp Register" name="CANSTM" offset="0xF8" size="2" mask="0xFFFF"/>
                <register caption="Message Data Register" name="CANMSG" offset="0xFA" size="1" mask="0xFF"/>
            </register-group>
        </module>
        <module caption="Analog Comparator" name="AC">
            <register-group caption="Analog Comparator" name="AC">
                <register caption="Analog Comparator 0 Control Register" name="AC0CON" offset="0x94" size="1">
                    <bitfield caption="Analog Comparator 0 Enable Bit" mask="0x80" name="AC0EN"/>
                    <bitfield caption="Analog Comparator 0 Interrupt Enable Bit" mask="0x40" name="AC0IE"/>
                    <bitfield caption="Analog Comparator 0 Interrupt Select Bits" mask="0x30" name="AC0IS"/>
                    <bitfield caption="Analog Comparator Clock Select" mask="0x08" name="ACCKSEL"/>
                    <bitfield caption="Analog Comparator 0 Multiplexer Register" mask="0x07" name="AC0M"/>
                </register>
                <register caption="Analog Comparator 1 Control Register" name="AC1CON" offset="0x95" size="1">
                    <bitfield caption="Analog Comparator 1 Enable Bit" mask="0x80" name="AC1EN"/>
                    <bitfield caption="Analog Comparator 1 Interrupt Enable Bit" mask="0x40" name="AC1IE"/>
                    <bitfield caption="Analog Comparator 1 Interrupt Select Bit" mask="0x30" name="AC1IS"
                              values="ANALOG_COMP_INTERRUPT"/>
                    <bitfield caption="Analog Comparator 1 Interrupt Capture Enable Bit" mask="0x08" name="AC1ICE"/>
                    <bitfield caption="Analog Comparator 1 Multiplexer Register" mask="0x07" name="AC1M"/>
                </register>
                <register caption="Analog Comparator 2 Control Register" name="AC2CON" offset="0x96" size="1">
                    <bitfield caption="Analog Comparator 2 Enable Bit" mask="0x80" name="AC2EN"/>
                    <bitfield caption="Analog Comparator 2 Interrupt Enable Bit" mask="0x40" name="AC2IE"/>
                    <bitfield caption="Analog Comparator 2 Interrupt Select Bit" mask="0x30" name="AC2IS"
                              values="ANALOG_COMP_INTERRUPT"/>
                    <bitfield caption="Analog Comparator 2 Multiplexer Register" mask="0x07" name="AC2M"/>
                </register>
                <register caption="Analog Comparator 3 Control Register" name="AC3CON" offset="0x97" size="1">
                    <bitfield caption="Analog Comparator 3 Enable Bit" mask="0x80" name="AC3EN"/>
                    <bitfield caption="Analog Comparator 3 Interrupt Enable Bit" mask="0x40" name="AC3IE"/>
                    <bitfield caption="Analog Comparator 3 Interrupt Select Bit" mask="0x30" name="AC3IS"
                              values="ANALOG_COMP_INTERRUPT"/>
                    <bitfield caption="Analog Comparator 3 Multiplexer Register" mask="0x07" name="AC3M"/>
                </register>
                <register caption="Analog Comparator Status Register" name="ACSR" offset="0x50" size="1" ocd-rw="R">
                    <bitfield caption="Analog Comparator 3 Interrupt Flag Bit" mask="0x80" name="AC3IF"/>
                    <bitfield caption="Analog Comparator 2 Interrupt Flag Bit" mask="0x40" name="AC2IF"/>
                    <bitfield caption="Analog Comparator 1 Interrupt Flag Bit" mask="0x20" name="AC1IF"/>
                    <bitfield caption="Analog Comparator 0 Interrupt Flag Bit" mask="0x10" name="AC0IF"/>
                    <bitfield caption="Analog Comparator 3 Output Bit" mask="0x08" name="AC3O"/>
                    <bitfield caption="Analog Comparator 2 Output Bit" mask="0x04" name="AC2O"/>
                    <bitfield caption="Analog Comparator 1 Output Bit" mask="0x02" name="AC1O"/>
                    <bitfield caption="Analog Comparator 0 Output Bit" mask="0x01" name="AC0O"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_COMP_INTERRUPT">
                <value caption="Interrupt on Toggle" name="VAL_0x00" value="0x00"/>
                <value caption="Reserved" name="VAL_0x01" value="0x01"/>
                <value caption="Interrupt on Falling Edge" name="VAL_0x02" value="0x02"/>
                <value caption="Interrupt on Rising Edge" name="VAL_0x03" value="0x03"/>
            </value-group>
        </module>
        <module caption="Digital-to-Analog Converter" name="DAC">
            <register-group caption="Digital-to-Analog Converter" name="DAC">
                <register caption="DAC Data Register" name="DAC" offset="0x91" size="2" ocd-rw="">
                    <bitfield caption="DAC Data Register Bits" mask="0xFFFF" name="DAC"/>
                </register>
                <register caption="DAC Control Register" name="DACON" offset="0x90" size="1">
                    <bitfield caption="DAC Auto Trigger Enable Bit" mask="0x80" name="DAATE"/>
                    <bitfield caption="DAC Trigger Selection Bits" mask="0x70" name="DATS"
                              values="ANALOG_DAC_AUTO_TRIGGER"/>
                    <bitfield caption="DAC Left Adjust" mask="0x04" name="DALA"/>
                    <bitfield caption="DAC Output Enable" mask="0x02" name="DAOE"/>
                    <bitfield caption="DAC Enable Bit" mask="0x01" name="DAEN"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_DAC_AUTO_TRIGGER">
                <value caption="Analog Comparator 0" name="VAL_0x00" value="0x00"/>
                <value caption="Analog Comparator 1" name="VAL_0x01" value="0x01"/>
                <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
                <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
                <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
                <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
                <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
                <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="CPU Registers" name="CPU">
            <register-group caption="CPU Registers" name="CPU">
                <register caption="Store Program Memory Control Register" name="SPMCSR" offset="0x57" size="1">
                    <bitfield caption="SPM Interrupt Enable" mask="0x80" name="SPMIE"/>
                    <bitfield caption="Read While Write Section Busy" mask="0x40" name="RWWSB"/>
                    <bitfield caption="Signature Row Read" mask="0x20" name="SIGRD"/>
                    <bitfield caption="Read While Write section read enable" mask="0x10" name="RWWSRE"/>
                    <bitfield caption="Boot Lock Bit Set" mask="0x08" name="BLBSET"/>
                    <bitfield caption="Page Write" mask="0x04" name="PGWRT"/>
                    <bitfield caption="Page Erase" mask="0x02" name="PGERS"/>
                    <bitfield caption="Store Program Memory Enable" mask="0x01" name="SPMEN"/>
                </register>
                <register caption="Status Register" name="SREG" offset="0x5F" size="1">
                    <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
                    <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
                    <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
                    <bitfield caption="Sign Bit" mask="0x10" name="S"/>
                    <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
                    <bitfield caption="Negative Flag" mask="0x04" name="N"/>
                    <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
                    <bitfield caption="Carry Flag" mask="0x01" name="C"/>
                </register>
