bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64M1.xml
                <register caption="Timer/Counter Control Register B" name="TCCR0B" offset="0x45" size="1">
                    <bitfield caption="Force Output Compare A" mask="0x80" name="FOC0A"/>
                    <bitfield caption="Force Output Compare B" mask="0x40" name="FOC0B"/>
                    <bitfield caption="" mask="0x08" name="WGM02"/>
                    <bitfield caption="Clock Select" mask="0x07" name="CS0" values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter0" name="TCNT0" offset="0x46" size="1" mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register A" name="OCR0A" offset="0x47" size="1"
                          mask="0xFF"/>
                <register caption="Timer/Counter0 Output Compare Register B" name="OCR0B" offset="0x48" size="1"
                          mask="0xFF"/>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Timer/Counter1 Input Capture Selection" mask="0x40" name="ICPSEL1"/>
                    <bitfield caption="Timer/Counter Prescaler Reset" mask="0x01" name="PSRSYNC"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Timer/Counter, 16-bit" name="TC16">
            <register-group caption="Timer/Counter, 16-bit" name="TC1">
                <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK1" offset="0x6F" size="1">
                    <bitfield caption="Timer/Counter1 Input Capture Interrupt Enable" mask="0x20" name="ICIE1"/>
                    <bitfield caption="Timer/Counter1 Output CompareB Match Interrupt Enable" mask="0x04"
                              name="OCIE1B"/>
                    <bitfield caption="Timer/Counter1 Output CompareA Match Interrupt Enable" mask="0x02"
                              name="OCIE1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Interrupt Enable" mask="0x01" name="TOIE1"/>
                </register>
                <register caption="Timer/Counter Interrupt Flag register" name="TIFR1" offset="0x36" size="1"
                          ocd-rw="R">
                    <bitfield caption="Input Capture Flag 1" mask="0x20" name="ICF1"/>
                    <bitfield caption="Output Compare Flag 1B" mask="0x04" name="OCF1B"/>
                    <bitfield caption="Output Compare Flag 1A" mask="0x02" name="OCF1A"/>
                    <bitfield caption="Timer/Counter1 Overflow Flag" mask="0x01" name="TOV1"/>
                </register>
                <register caption="Timer/Counter1 Control Register A" name="TCCR1A" offset="0x80" size="1">
                    <bitfield caption="Compare Output Mode for Channel A" mask="0xC0" name="COM1A"/>
                    <bitfield caption="Compare Output Mode for Channel B" mask="0x30" name="COM1B"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x03" name="WGM1"/>
                </register>
                <register caption="Timer/Counter1 Control Register B" name="TCCR1B" offset="0x81" size="1">
                    <bitfield caption="Input Capture 1 Noise Canceler" mask="0x80" name="ICNC1"/>
                    <bitfield caption="Input Capture 1 Edge Select" mask="0x40" name="ICES1"/>
                    <bitfield caption="Waveform Generation Mode" mask="0x18" name="WGM1" lsb="2"/>
                    <bitfield caption="Prescaler source of Timer/Counter 1" mask="0x07" name="CS1"
                              values="CLK_SEL_3BIT_EXT"/>
                </register>
                <register caption="Timer/Counter1 Control Register C" name="TCCR1C" offset="0x82" size="1" ocd-rw="">
                    <bitfield caption="Force Output Compare for Channel A" mask="0x80" name="FOC1A"/>
                    <bitfield caption="Force Output Compare for Channel B" mask="0x40" name="FOC1B"/>
                </register>
                <register caption="Timer/Counter1 Bytes" name="TCNT1" offset="0x84" size="2" mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register A" name="OCR1A" offset="0x88" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Output Compare Register B" name="OCR1B" offset="0x8A" size="2"
                          mask="0xFFFF"/>
                <register caption="Timer/Counter1 Input Capture Register" name="ICR1" offset="0x86" size="2"
                          mask="0xFFFF"/>
                <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
                    <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
                    <bitfield caption="Timer/Counter1 Input Capture Selection" mask="0x40" name="ICPSEL1"/>
                    <bitfield caption="Timer/Counter Prescaler Reset" mask="0x01" name="PSRSYNC"/>
                </register>
            </register-group>
            <value-group caption="" name="CLK_SEL_3BIT_EXT">
                <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
                <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
                <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
                <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
                <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
                <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
                <value caption="Running, ExtClk Tn Falling Edge" name="VAL_0x06" value="0x06"/>
                <value caption="Running, ExtClk Tn Rising Edge" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Analog-to-Digital Converter" name="ADC">
            <register-group caption="Analog-to-Digital Converter" name="ADC">
                <register caption="The ADC multiplexer Selection Register" name="ADMUX" offset="0x7C" size="1">
                    <bitfield caption="Reference Selection Bits" mask="0xC0" name="REFS" values="ANALOG_ADC_V_REF2"/>
                    <bitfield caption="Left Adjust Result" mask="0x20" name="ADLAR"/>
                    <bitfield caption="ADC channel selection bits" mask="0x1F" name="MUX" values="ANALOG_ADC_MUXPOS"/>
                </register>
                <register caption="The ADC Control and Status register" name="ADCSRA" offset="0x7A" size="1" ocd-rw="R">
                    <bitfield caption="ADC Enable" mask="0x80" name="ADEN"/>
                    <bitfield caption="ADC Start Conversion" mask="0x40" name="ADSC"/>
                    <bitfield caption="ADC Auto Trigger Enable" mask="0x20" name="ADATE"/>
                    <bitfield caption="ADC Interrupt Flag" mask="0x10" name="ADIF"/>
                    <bitfield caption="ADC Interrupt Enable" mask="0x08" name="ADIE"/>
                    <bitfield caption="ADC Prescaler Select Bits" mask="0x07" name="ADPS"/>
                </register>
                <register caption="ADC Data Register Bytes" name="ADC" offset="0x78" size="2" mask="0xFFFF"/>
                <register caption="ADC Control and Status Register B" name="ADCSRB" offset="0x7B" size="1">
                    <bitfield caption="ADC High Speed Mode" mask="0x80" name="ADHSM"/>
                    <bitfield caption="Current Source Enable" mask="0x40" name="ISRCEN"/>
                    <bitfield caption="Analog Reference pin Enable" mask="0x20" name="AREFEN"/>
                    <bitfield caption="ADC Auto Trigger Sources" mask="0x0F" name="ADTS"
                              values="ANALOG_ADC_AUTO_TRIGGER_4BITS"/>
                </register>
                <register caption="Digital Input Disable Register 0" name="DIDR0" offset="0x7E" size="1">
                    <bitfield caption="ADC7 Digital input Disable" mask="0x80" name="ADC7D"/>
                    <bitfield caption="ADC6 Digital input Disable" mask="0x40" name="ADC6D"/>
                    <bitfield caption="ADC5 Digital input Disable" mask="0x20" name="ADC5D"/>
                    <bitfield caption="ADC4 Digital input Disable" mask="0x10" name="ADC4D"/>
                    <bitfield caption="ADC3 Digital input Disable" mask="0x08" name="ADC3D"/>
                    <bitfield caption="ADC2 Digital input Disable" mask="0x04" name="ADC2D"/>
                    <bitfield caption="ADC1 Digital input Disable" mask="0x02" name="ADC1D"/>
                    <bitfield caption="ADC0 Digital input Disable" mask="0x01" name="ADC0D"/>
                </register>
                <register caption="Digital Input Disable Register 0" name="DIDR1" offset="0x7F" size="1">
                    <bitfield caption="AMP2P Pin Digital input Disable" mask="0x40" name="AMP2PD"/>
                    <bitfield caption="ACMP0 Pin Digital input Disable" mask="0x20" name="ACMP0D"/>
                    <bitfield caption="AMP0P Pin Digital input Disable" mask="0x10" name="AMP0PD"/>
                    <bitfield caption="AMP0N Pin Digital input Disable" mask="0x08" name="AMP0ND"/>
                    <bitfield caption="ADC10 Pin Digital input Disable" mask="0x04" name="ADC10D"/>
                    <bitfield caption="ADC9 Pin Digital input Disable" mask="0x02" name="ADC9D"/>
                    <bitfield caption="ADC8 Pin Digital input Disable" mask="0x01" name="ADC8D"/>
                </register>
                <register caption="Amplifier 0 Control and Status Register" name="AMP0CSR" offset="0x75" size="1">
                    <bitfield caption="Amplifier 0 Enable" mask="0x80" name="AMP0EN"/>
                    <bitfield caption="Amplifier 0 Input Shunt" mask="0x40" name="AMP0IS"/>
                    <bitfield caption="Amplifier 0 Gain Selection" mask="0x30" name="AMP0G"/>
                    <bitfield caption="Amplifier 0 - Comparator 0 connection" mask="0x08" name="AMPCMP0"/>
                    <bitfield caption="Amplifier 0 Clock Source Selection" mask="0x07" name="AMP0TS"/>
                </register>
                <register caption="Amplifier 1 Control and Status Register" name="AMP1CSR" offset="0x76" size="1">
                    <bitfield caption="Amplifier 1 Enable" mask="0x80" name="AMP1EN"/>
                    <bitfield caption="Amplifier 1 Input Shunt" mask="0x40" name="AMP1IS"/>
                    <bitfield caption="Amplifier 1 Gain Selection" mask="0x30" name="AMP1G"/>
                    <bitfield caption="Amplifier 1 - Comparator 1 Connection" mask="0x08" name="AMPCMP1"/>
                    <bitfield caption="Amplifier 1 Clock Source Selection" mask="0x07" name="AMP1TS"/>
                </register>
                <register caption="Amplifier 2 Control and Status Register" name="AMP2CSR" offset="0x77" size="1">
                    <bitfield caption="Amplifier 2 Enable" mask="0x80" name="AMP2EN"/>
                    <bitfield caption="Amplifier 2 Input Shunt" mask="0x40" name="AMP2IS"/>
                    <bitfield caption="Amplifier 2 Gain Selection" mask="0x30" name="AMP2G"/>
                    <bitfield caption="Amplifier 2 - Comparator 2 Connection" mask="0x08" name="AMPCMP2"/>
                    <bitfield caption="Amplifier 2 Clock Source Selection" mask="0x07" name="AMP2TS"/>
                </register>
            </register-group>
            <value-group caption="" name="ANALOG_ADC_V_REF2">
                <value caption="AREF, Internal Vref turned off" name="VAL_0x00" value="0x00"/>
                <value caption="AVCC reference" name="VAL_0x01" value="0x01"/>
                <value caption="Reserved" name="VAL_0x02" value="0x02"/>
                <value caption="Internal 2.56V Voltage Reference" name="VAL_0x03" value="0x03"/>
            </value-group>
