bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64M1.xml
            <value-group caption="" name="ANALOG_ADC_AUTO_TRIGGER_4BITS">
                <value caption="Free Running mode" name="VAL_0x00" value="0x00"/>
                <value caption="Analog Comparator" name="VAL_0x01" value="0x01"/>
                <value caption="External Interrupt Request 0" name="VAL_0x02" value="0x02"/>
                <value caption="Timer/Counter0 Compare Match A" name="VAL_0x03" value="0x03"/>
                <value caption="Timer/Counter0 Overflow" name="VAL_0x04" value="0x04"/>
                <value caption="Timer/Counter1 Compare Match B" name="VAL_0x05" value="0x05"/>
                <value caption="Timer/Counter1 Overflow" name="VAL_0x06" value="0x06"/>
                <value caption="Timer/Counter1 Capture Event" name="VAL_0x07" value="0x07"/>
                <value caption="PSC0ASY Event" name="VAL_0x08" value="0x08"/>
                <value caption="PSC1ASY Event" name="VAL_0x09" value="0x09"/>
                <value caption="PSC2ASY Event" name="VAL_0x0A" value="0x0A"/>
                <value caption="Analog comparator 1" name="VAL_0x0B" value="0x0B"/>
                <value caption="Analog comparator 2" name="VAL_0x0C" value="0x0C"/>
            </value-group>
            <value-group caption="Analog Channel Selection Bits select" name="ANALOG_ADC_MUXPOS">
                <value caption="ADC input pin 0" name="ADC0" value="0x0"/>
                <value caption="ADC input pin 1" name="ADC1" value="0x1"/>
                <value caption="ADC input pin 2" name="ADC2" value="0x2"/>
                <value caption="ADC input pin 3" name="ADC3" value="0x3"/>
                <value caption="ADC input pin 4" name="ADC4" value="0x4"/>
                <value caption="ADC input pin 5" name="ADC5" value="0x5"/>
                <value caption="ADC input pin 6" name="ADC6" value="0x6"/>
                <value caption="ADC input pin 7" name="ADC7" value="0x7"/>
                <value caption="ADC input pin 8" name="ADC8" value="0x8"/>
                <value caption="ADC input pin 9" name="ADC9" value="0x9"/>
                <value caption="ADC input pin 10" name="ADC10" value="0xA"/>
                <value caption="Temperature sensor" name="TEMPSENSE" value="0xB"/>
                <value caption="Internal VCC / 4" name="VCC4" value="0xC"/>
                <value caption="Current source" name="ISRC" value="0xD"/>
                <value caption="Analog Differential Amplifier 0" name="AMP0" value="0xE"/>
                <value caption="Analog Differential Amplifier 1" name="AMP1" value="0xF"/>
                <value caption="Analog Differential Amplifier 2" name="AMP2" value="0x10"/>
                <value caption="Bandgap" name="BNDGAP" value="0x11"/>
                <value caption="0V (GND)" name="GND" value="0x12"/>
            </value-group>
        </module>
        <module caption="Local Interconnect Network" name="LINUART">
            <register-group caption="Local Interconnect Network" name="LINUART">
                <register caption="LIN Control Register" name="LINCR" offset="0xC8" size="1">
                    <bitfield caption="Software Reset" mask="0x80" name="LSWRES"/>
                    <bitfield caption="LIN Standard" mask="0x40" name="LIN13"/>
                    <bitfield caption="LIN Configuration bits" mask="0x30" name="LCONF"/>
                    <bitfield caption="LIN or UART Enable" mask="0x08" name="LENA"/>
                    <bitfield caption="LIN Command and Mode bits" mask="0x07" name="LCMD"/>
                </register>
                <register caption="LIN Status and Interrupt Register" name="LINSIR" offset="0xC9" size="1">
                    <bitfield caption="Identifier Status bits" mask="0xE0" name="LIDST"/>
                    <bitfield caption="Busy Signal" mask="0x10" name="LBUSY"/>
                    <bitfield caption="Error Interrupt" mask="0x08" name="LERR"/>
                    <bitfield caption="Identifier Interrupt" mask="0x04" name="LIDOK"/>
                    <bitfield caption="Transmit Performed Interrupt" mask="0x02" name="LTXOK"/>
                    <bitfield caption="Receive Performed Interrupt" mask="0x01" name="LRXOK"/>
                </register>
                <register caption="LIN Enable Interrupt Register" name="LINENIR" offset="0xCA" size="1">
                    <bitfield caption="Enable Error Interrupt" mask="0x08" name="LENERR"/>
                    <bitfield caption="Enable Identifier Interrupt" mask="0x04" name="LENIDOK"/>
                    <bitfield caption="Enable Transmit Performed Interrupt" mask="0x02" name="LENTXOK"/>
                    <bitfield caption="Enable Receive Performed Interrupt" mask="0x01" name="LENRXOK"/>
                </register>
                <register caption="LIN Error Register" name="LINERR" offset="0xCB" size="1" ocd-rw="R">
                    <bitfield caption="Abort Flag" mask="0x80" name="LABORT"/>
                    <bitfield caption="Frame Time Out Error Flag" mask="0x40" name="LTOERR"/>
                    <bitfield caption="Overrun Error Flag" mask="0x20" name="LOVERR"/>
                    <bitfield caption="Framing Error Flag" mask="0x10" name="LFERR"/>
                    <bitfield caption="Synchronization Error Flag" mask="0x08" name="LSERR"/>
                    <bitfield caption="Parity Error Flag" mask="0x04" name="LPERR"/>
                    <bitfield caption="Checksum Error Flag" mask="0x02" name="LCERR"/>
                    <bitfield caption="Bit Error Flag" mask="0x01" name="LBERR"/>
                </register>
                <register caption="LIN Bit Timing Register" name="LINBTR" offset="0xCC" size="1">
                    <bitfield caption="Disable Bit Timing Resynchronization" mask="0x80" name="LDISR"/>
                    <bitfield caption="LIN Bit Timing bits" mask="0x3F" name="LBT"/>
                </register>
                <register caption="LIN Baud Rate Register" name="LINBRR" offset="0xCD" size="2">
                    <bitfield caption="" mask="0x0FFF" name="LDIV"/>
                </register>
                <register caption="LIN Data Length Register" name="LINDLR" offset="0xCF" size="1">
                    <bitfield caption="LIN Transmit Data Length bits" mask="0xF0" name="LTXDL"/>
                    <bitfield caption="LIN Receive Data Length bits" mask="0x0F" name="LRXDL"/>
                </register>
