bloombloombloom/Bloom/src/Targets/TargetDescriptionFiles/AVR8/MEGA/ATMEGA64M1.xml
                <register caption="LIN Identifier Register" name="LINIDR" offset="0xD0" size="1">
                    <bitfield caption="Parity bits" mask="0xC0" name="LP"/>
                    <bitfield caption="Identifier bit 5 or Data Length bits" mask="0x3F" name="LID"/>
                </register>
                <register caption="LIN Data Buffer Selection Register" name="LINSEL" offset="0xD1" size="1">
                    <bitfield caption="Auto Increment of Data Buffer Index (Active Low)" mask="0x08" name="LAINC"/>
                    <bitfield caption="FIFO LIN Data Buffer Index bits" mask="0x07" name="LINDX"/>
                </register>
                <register caption="LIN Data Register" name="LINDAT" offset="0xD2" size="1">
                    <bitfield caption="LIN Data In / Data out" mask="0xFF" name="LDATA"/>
                </register>
            </register-group>
        </module>
        <module caption="Serial Peripheral Interface" name="SPI">
            <register-group caption="Serial Peripheral Interface" name="SPI">
                <register caption="SPI Control Register" name="SPCR" offset="0x4C" size="1">
                    <bitfield caption="SPI Interrupt Enable" mask="0x80" name="SPIE"/>
                    <bitfield caption="SPI Enable" mask="0x40" name="SPE"/>
                    <bitfield caption="Data Order" mask="0x20" name="DORD"/>
                    <bitfield caption="Master/Slave Select" mask="0x10" name="MSTR"/>
                    <bitfield caption="Clock polarity" mask="0x08" name="CPOL"/>
                    <bitfield caption="Clock Phase" mask="0x04" name="CPHA"/>
                    <bitfield caption="SPI Clock Rate Selects" mask="0x03" name="SPR" values="COMM_SCK_RATE_3BIT"/>
                </register>
                <register caption="SPI Status Register" name="SPSR" offset="0x4D" size="1" ocd-rw="R">
                    <bitfield caption="SPI Interrupt Flag" mask="0x80" name="SPIF"/>
                    <bitfield caption="Write Collision Flag" mask="0x40" name="WCOL"/>
                    <bitfield caption="Double SPI Speed Bit" mask="0x01" name="SPI2X"/>
                </register>
                <register caption="SPI Data Register" name="SPDR" offset="0x4E" size="1" mask="0xFF" ocd-rw=""/>
            </register-group>
            <value-group caption="" name="COMM_SCK_RATE_3BIT">
                <value caption="fosc/4" name="VAL_0x00" value="0x00"/>
                <value caption="fosc/16" name="VAL_0x01" value="0x01"/>
                <value caption="fosc/64" name="VAL_0x02" value="0x02"/>
                <value caption="fosc/128" name="VAL_0x03" value="0x03"/>
                <value caption="fosc/2" name="VAL_0x04" value="0x04"/>
                <value caption="fosc/8" name="VAL_0x05" value="0x05"/>
                <value caption="fosc/32" name="VAL_0x06" value="0x06"/>
                <value caption="fosc/64" name="VAL_0x07" value="0x07"/>
            </value-group>
        </module>
        <module caption="Watchdog Timer" name="WDT">
            <register-group caption="Watchdog Timer" name="WDT">
                <register caption="Watchdog Timer Control Register" name="WDTCSR" offset="0x60" size="1" ocd-rw="R">
                    <bitfield caption="Watchdog Timeout Interrupt Flag" mask="0x80" name="WDIF"/>
                    <bitfield caption="Watchdog Timeout Interrupt Enable" mask="0x40" name="WDIE"/>
                    <bitfield caption="Watchdog Timer Prescaler Bits" mask="0x27" name="WDP"
                              values="WDOG_TIMER_PRESCALE_4BITS"/>
                    <bitfield caption="Watchdog Change Enable" mask="0x10" name="WDCE"/>
                    <bitfield caption="Watch Dog Enable" mask="0x08" name="WDE"/>
                </register>
            </register-group>
            <value-group caption="" name="WDOG_TIMER_PRESCALE_4BITS">
                <value caption="Oscillator Cycles 2K" name="VAL_0x00" value="0x00"/>
                <value caption="Oscillator Cycles 4K" name="VAL_0x01" value="0x01"/>
                <value caption="Oscillator Cycles 8K" name="VAL_0x02" value="0x02"/>
                <value caption="Oscillator Cycles 16K" name="VAL_0x03" value="0x03"/>
                <value caption="Oscillator Cycles 32K" name="VAL_0x04" value="0x04"/>
                <value caption="Oscillator Cycles 64K" name="VAL_0x05" value="0x05"/>
                <value caption="Oscillator Cycles 128K" name="VAL_0x06" value="0x06"/>
                <value caption="Oscillator Cycles 256K" name="VAL_0x07" value="0x07"/>
                <value caption="Oscillator Cycles 512K" name="VAL_0x08" value="0x08"/>
                <value caption="Oscillator Cycles 1024K" name="VAL_0x09" value="0x09"/>
            </value-group>
        </module>
        <module caption="External Interrupts" name="EXINT">
            <register-group caption="External Interrupts" name="EXINT">
                <register caption="External Interrupt Control Register" name="EICRA" offset="0x69" size="1">
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0xC0" name="ISC3"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control Bit" mask="0x30" name="ISC2"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control 1 Bits" mask="0x0C" name="ISC1"
                              values="INTERRUPT_SENSE_CONTROL"/>
                    <bitfield caption="External Interrupt Sense Control 0 Bits" mask="0x03" name="ISC0"
                              values="INTERRUPT_SENSE_CONTROL"/>
                </register>
                <register caption="External Interrupt Mask Register" name="EIMSK" offset="0x3D" size="1">
                    <bitfield caption="External Interrupt Request 3 Enable" mask="0x0F" name="INT"/>
                </register>
                <register caption="External Interrupt Flag Register" name="EIFR" offset="0x3C" size="1" ocd-rw="R">
                    <bitfield caption="External Interrupt Flags" mask="0x0F" name="INTF"/>
                </register>
